why-growing-wiki.org
#+title: Why Growing Wiki?
#+date: [2025-12-15 Mon 15:14]
#+HUGO_BASE_DIR: /home/james/wiki/.site
#+HUGO_SECTION: 
#+HUGO_DRAFT: false
#+HUGO_DATE: 2025-12-15
#+EXPORT_FILE_NAME: why-growing-wiki

* TODO Content
:PROPERTIES:
:ID:       20251215T151413.540793
:END:

The idea of sharing my notes and learning with the internet wasn't actually a recent thought. I came across such concepts ever since the discovering of productivity tools like Logseq and Obsidian.

Not ashamed to share this, this is not my first attempt at it.
