.site/content/why-growing-wiki.md
+++
title = "Why Growing Wiki?"
author = ["James"]
date = 2025-12-15T15:14:00+00:00
draft = false
+++

## <span class="org-todo todo TODO">TODO</span> Content {#content}

The idea of sharing my notes and learning with the internet wasn't actually a recent thought. I came across such concepts ever since the discovering of productivity tools like Logseq and Obsidian.

Not ashamed to share this, this is not my first attempt at it.
